* debug svg vs g
#+begin_src emacs-lisp :results pp
(nthcdr 5 (gua--svg-yaos (gua-binary->internal "101010") 75.0 100.0))
#+end_src

#+RESULTS:
#+begin_example
((g
  ((fill . "#111"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "4%")
    (y . "82%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "64%")
    (y . "82%")))))
#+end_example

#+begin_src emacs-lisp :results pp
(nthcdr 5 (gua--svg-yaos (gua-binary->internal "101010") 75.0 100.0))
#+end_src

#+RESULTS:
#+begin_example
((svg
  ((fill . "#111")
   (x . 0)
   (y . "88%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "0%")
    (y . "0%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "60%")
    (y . "0%")))))
#+end_example


The problem is in outlined [[https://stackoverflow.com/questions/479591/svg-positioning][stackoverflow svg-positioning]] question, where svg should be used in place of g(group).

note: add overflow="visible", if svg clips.
* text dom node 
#+begin_src emacs-lisp 
'(text ((x . "50%")
        (y . "50%")
        (dominant-baseline . "middle")
        (text-anchor . "middle")))
#+end_src
* new

#+begin_src emacs-lisp :results pp
(gua--svg-yaos (gua-binary->internal "110000") 75.0 100.0)
#+end_src

#+RESULTS:
#+begin_example
(g
 ((transform . "scale(0.850000)\ntranslate(5.625000, 7.500000)"))
 (svg
  ((fill . "#f10")
   (x . 0)
   (y . "0%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "100%")
    (height . "100%")
    (x . "0%")
    (y . "0%"))))
 (svg
  ((fill . "#f10")
   (x . 0)
   (y . "17%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "100%")
    (height . "100%")
    (x . "0%")
    (y . "0%"))))
 (svg
  ((fill . "#111")
   (x . 0)
   (y . "35%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "0%")
    (y . "0%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "60%")
    (y . "0%"))))
 (svg
  ((fill . "#111")
   (x . 0)
   (y . "53%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "0%")
    (y . "0%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "60%")
    (y . "0%"))))
 (svg
  ((fill . "#111")
   (x . 0)
   (y . "70%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "0%")
    (y . "0%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "60%")
    (y . "0%"))))
 (svg
  ((fill . "#111")
   (x . 0)
   (y . "88%")
   (width . "100%")
   (height . "10%"))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "0%")
    (y . "0%")))
  (rect
   ((width . "40%")
    (height . "61%")
    (x . "60%")
    (y . "0%")))))
#+end_example

